Tianshang301/TianshangPulse/firmware/sdkconfig.defaults
# ESP-IDF v5.4+ / ESP32-P4 target
CONFIG_IDF_TARGET="esp32p4"

# PSRAM: 16MB external, required for TFLite Micro arena
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y

# BLE GATT Server
CONFIG_BT_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# I2C bus (shared by MAX30102 + MPU6886)
CONFIG_SENSOR_I2C_PORT=0
CONFIG_SENSOR_SDA_GPIO=18
CONFIG_SENSOR_SCL_GPIO=8

# LVGL
CONFIG_LVGL_MAX_DISPLAY_BUFFERS=2
